dummyIntegrateData.yml
config:
  payload:
    path: "dataId.csv"
    fields:
      - "id"
  target: "https://moonlay-api.dbo.dev"
  processor: "./generateFaker.js"
  phases:
    - duration: 1
      arrivalRate: 2
    # - duration: 9
    #   arrivalRate: 15
   
scenarios:
  - flow:
          - function: "createRandomUser"
          - put: 
              url: "/order-srv/delivery-orders/{{ uuid }}"
              headers:
                X-CHANNEL: "web_manager"
                Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="
              json:
                  warehouse_id: 4
                  order_source_id: 1
                  order_status_id: 17
                  do_ref_code: "Testing-054"
                  do_ref_date: "2023-04-17"
                  driver_name: "test"
                  plat_number: "B1912BC"
                  note: "Test Note DO"
                  delivery_order_details:
                    - id: "{{ do_detail_id }}"
                      qty: 0
                      note: "send"